---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyDoubleArray4d..::..IsValidValue Method
AssetPropertyDoubleArray4d Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue(IList<(Of <<'(Double>)>>)) | Checks that the value is a valid value for this property. |
|  | IsValidValue(Color) | Checks that the value is a valid value for this property. |

# See Also

AssetPropertyDoubleArray4d Class

AssetPropertyDoubleArray4d Members

Autodesk.Revit.DB.Visual Namespace